INCLUDE ../Utils/AI.ink

// to do: refactor

~AIGenerateImage("InfirmaryBG", "задний фон для игры, лазарет, большая палатка изнутри.", 1280, 720)
~AIGenerateImage("CampBG", "задний фон для игры, главная площадка лагеря повстанцев, который находится среди леса за бетонными стенами. На площадке находится толпа шумных людей, которые идут по своим делам. От площадки отходят дороги в разные части лагеря: на тренировочную площадку, в казармы и в столовую.", 1280, 720)
~AIGenerateImage("BarracksBG", "задний фон для игры, тренировочная площадка, казарма, тир.", 1280, 720)
~AIGenerateImage("СanteenBG", "задний фон для игры, столовая в лагере сопротивления, заполненная шумными людьми, пост-апокалипсис.", 1280, 720)
